RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18.h
/* FSTAT Bit Fields */
#define FTFE_FSTAT_MGSTAT0_MASK                  0x1u
#define FTFE_FSTAT_MGSTAT0_SHIFT                 0
#define FTFE_FSTAT_MGSTAT0_WIDTH                 1
#define FTFE_FSTAT_MGSTAT0(x)                    (((uint8_t)(((uint8_t)(x))<<FTFE_FSTAT_MGSTAT0_SHIFT))&FTFE_FSTAT_MGSTAT0_MASK)
#define FTFE_FSTAT_FPVIOL_MASK                   0x10u
#define FTFE_FSTAT_FPVIOL_SHIFT                  4
#define FTFE_FSTAT_FPVIOL_WIDTH                  1
#define FTFE_FSTAT_FPVIOL(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FSTAT_FPVIOL_SHIFT))&FTFE_FSTAT_FPVIOL_MASK)
#define FTFE_FSTAT_ACCERR_MASK                   0x20u
#define FTFE_FSTAT_ACCERR_SHIFT                  5
#define FTFE_FSTAT_ACCERR_WIDTH                  1
#define FTFE_FSTAT_ACCERR(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FSTAT_ACCERR_SHIFT))&FTFE_FSTAT_ACCERR_MASK)
#define FTFE_FSTAT_RDCOLERR_MASK                 0x40u
#define FTFE_FSTAT_RDCOLERR_SHIFT                6
#define FTFE_FSTAT_RDCOLERR_WIDTH                1
#define FTFE_FSTAT_RDCOLERR(x)                   (((uint8_t)(((uint8_t)(x))<<FTFE_FSTAT_RDCOLERR_SHIFT))&FTFE_FSTAT_RDCOLERR_MASK)
#define FTFE_FSTAT_CCIF_MASK                     0x80u
#define FTFE_FSTAT_CCIF_SHIFT                    7
#define FTFE_FSTAT_CCIF_WIDTH                    1
#define FTFE_FSTAT_CCIF(x)                       (((uint8_t)(((uint8_t)(x))<<FTFE_FSTAT_CCIF_SHIFT))&FTFE_FSTAT_CCIF_MASK)
/* FCNFG Bit Fields */
#define FTFE_FCNFG_EEERDY_MASK                   0x1u
#define FTFE_FCNFG_EEERDY_SHIFT                  0
#define FTFE_FCNFG_EEERDY_WIDTH                  1
#define FTFE_FCNFG_EEERDY(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCNFG_EEERDY_SHIFT))&FTFE_FCNFG_EEERDY_MASK)
#define FTFE_FCNFG_RAMRDY_MASK                   0x2u
#define FTFE_FCNFG_RAMRDY_SHIFT                  1
#define FTFE_FCNFG_RAMRDY_WIDTH                  1
#define FTFE_FCNFG_RAMRDY(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCNFG_RAMRDY_SHIFT))&FTFE_FCNFG_RAMRDY_MASK)
#define FTFE_FCNFG_PFLSH_MASK                    0x4u
#define FTFE_FCNFG_PFLSH_SHIFT                   2
#define FTFE_FCNFG_PFLSH_WIDTH                   1
#define FTFE_FCNFG_PFLSH(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FCNFG_PFLSH_SHIFT))&FTFE_FCNFG_PFLSH_MASK)
#define FTFE_FCNFG_SWAP_MASK                     0x8u
#define FTFE_FCNFG_SWAP_SHIFT                    3
#define FTFE_FCNFG_SWAP_WIDTH                    1
#define FTFE_FCNFG_SWAP(x)                       (((uint8_t)(((uint8_t)(x))<<FTFE_FCNFG_SWAP_SHIFT))&FTFE_FCNFG_SWAP_MASK)
#define FTFE_FCNFG_ERSSUSP_MASK                  0x10u
#define FTFE_FCNFG_ERSSUSP_SHIFT                 4
#define FTFE_FCNFG_ERSSUSP_WIDTH                 1
#define FTFE_FCNFG_ERSSUSP(x)                    (((uint8_t)(((uint8_t)(x))<<FTFE_FCNFG_ERSSUSP_SHIFT))&FTFE_FCNFG_ERSSUSP_MASK)
#define FTFE_FCNFG_ERSAREQ_MASK                  0x20u
#define FTFE_FCNFG_ERSAREQ_SHIFT                 5
#define FTFE_FCNFG_ERSAREQ_WIDTH                 1
#define FTFE_FCNFG_ERSAREQ(x)                    (((uint8_t)(((uint8_t)(x))<<FTFE_FCNFG_ERSAREQ_SHIFT))&FTFE_FCNFG_ERSAREQ_MASK)
#define FTFE_FCNFG_RDCOLLIE_MASK                 0x40u
#define FTFE_FCNFG_RDCOLLIE_SHIFT                6
#define FTFE_FCNFG_RDCOLLIE_WIDTH                1
#define FTFE_FCNFG_RDCOLLIE(x)                   (((uint8_t)(((uint8_t)(x))<<FTFE_FCNFG_RDCOLLIE_SHIFT))&FTFE_FCNFG_RDCOLLIE_MASK)
#define FTFE_FCNFG_CCIE_MASK                     0x80u
#define FTFE_FCNFG_CCIE_SHIFT                    7
#define FTFE_FCNFG_CCIE_WIDTH                    1
#define FTFE_FCNFG_CCIE(x)                       (((uint8_t)(((uint8_t)(x))<<FTFE_FCNFG_CCIE_SHIFT))&FTFE_FCNFG_CCIE_MASK)
/* FSEC Bit Fields */
#define FTFE_FSEC_SEC_MASK                       0x3u
#define FTFE_FSEC_SEC_SHIFT                      0
#define FTFE_FSEC_SEC_WIDTH                      2
#define FTFE_FSEC_SEC(x)                         (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_SEC_SHIFT))&FTFE_FSEC_SEC_MASK)
#define FTFE_FSEC_FSLACC_MASK                    0xCu
#define FTFE_FSEC_FSLACC_SHIFT                   2
#define FTFE_FSEC_FSLACC_WIDTH                   2
#define FTFE_FSEC_FSLACC(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_FSLACC_SHIFT))&FTFE_FSEC_FSLACC_MASK)
#define FTFE_FSEC_MEEN_MASK                      0x30u
#define FTFE_FSEC_MEEN_SHIFT                     4
#define FTFE_FSEC_MEEN_WIDTH                     2
#define FTFE_FSEC_MEEN(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_MEEN_SHIFT))&FTFE_FSEC_MEEN_MASK)
#define FTFE_FSEC_KEYEN_MASK                     0xC0u
#define FTFE_FSEC_KEYEN_SHIFT                    6
#define FTFE_FSEC_KEYEN_WIDTH                    2
#define FTFE_FSEC_KEYEN(x)                       (((uint8_t)(((uint8_t)(x))<<FTFE_FSEC_KEYEN_SHIFT))&FTFE_FSEC_KEYEN_MASK)
/* FOPT Bit Fields */
#define FTFE_FOPT_OPT_MASK                       0xFFu
#define FTFE_FOPT_OPT_SHIFT                      0
#define FTFE_FOPT_OPT_WIDTH                      8
#define FTFE_FOPT_OPT(x)                         (((uint8_t)(((uint8_t)(x))<<FTFE_FOPT_OPT_SHIFT))&FTFE_FOPT_OPT_MASK)
/* FCCOB3 Bit Fields */
#define FTFE_FCCOB3_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB3_CCOBn_SHIFT                  0
#define FTFE_FCCOB3_CCOBn_WIDTH                  8
#define FTFE_FCCOB3_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB3_CCOBn_SHIFT))&FTFE_FCCOB3_CCOBn_MASK)
/* FCCOB2 Bit Fields */
#define FTFE_FCCOB2_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB2_CCOBn_SHIFT                  0
#define FTFE_FCCOB2_CCOBn_WIDTH                  8
#define FTFE_FCCOB2_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB2_CCOBn_SHIFT))&FTFE_FCCOB2_CCOBn_MASK)
/* FCCOB1 Bit Fields */
#define FTFE_FCCOB1_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB1_CCOBn_SHIFT                  0
#define FTFE_FCCOB1_CCOBn_WIDTH                  8
#define FTFE_FCCOB1_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB1_CCOBn_SHIFT))&FTFE_FCCOB1_CCOBn_MASK)
/* FCCOB0 Bit Fields */
#define FTFE_FCCOB0_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB0_CCOBn_SHIFT                  0
#define FTFE_FCCOB0_CCOBn_WIDTH                  8
#define FTFE_FCCOB0_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB0_CCOBn_SHIFT))&FTFE_FCCOB0_CCOBn_MASK)
/* FCCOB7 Bit Fields */
#define FTFE_FCCOB7_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB7_CCOBn_SHIFT                  0
#define FTFE_FCCOB7_CCOBn_WIDTH                  8
#define FTFE_FCCOB7_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB7_CCOBn_SHIFT))&FTFE_FCCOB7_CCOBn_MASK)
/* FCCOB6 Bit Fields */
#define FTFE_FCCOB6_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB6_CCOBn_SHIFT                  0
#define FTFE_FCCOB6_CCOBn_WIDTH                  8
#define FTFE_FCCOB6_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB6_CCOBn_SHIFT))&FTFE_FCCOB6_CCOBn_MASK)
/* FCCOB5 Bit Fields */
#define FTFE_FCCOB5_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB5_CCOBn_SHIFT                  0
#define FTFE_FCCOB5_CCOBn_WIDTH                  8
#define FTFE_FCCOB5_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB5_CCOBn_SHIFT))&FTFE_FCCOB5_CCOBn_MASK)
/* FCCOB4 Bit Fields */
#define FTFE_FCCOB4_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB4_CCOBn_SHIFT                  0
#define FTFE_FCCOB4_CCOBn_WIDTH                  8
#define FTFE_FCCOB4_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB4_CCOBn_SHIFT))&FTFE_FCCOB4_CCOBn_MASK)
/* FCCOBB Bit Fields */
#define FTFE_FCCOBB_CCOBn_MASK                   0xFFu
#define FTFE_FCCOBB_CCOBn_SHIFT                  0
#define FTFE_FCCOBB_CCOBn_WIDTH                  8
#define FTFE_FCCOBB_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOBB_CCOBn_SHIFT))&FTFE_FCCOBB_CCOBn_MASK)
/* FCCOBA Bit Fields */
#define FTFE_FCCOBA_CCOBn_MASK                   0xFFu
#define FTFE_FCCOBA_CCOBn_SHIFT                  0
#define FTFE_FCCOBA_CCOBn_WIDTH                  8
#define FTFE_FCCOBA_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOBA_CCOBn_SHIFT))&FTFE_FCCOBA_CCOBn_MASK)
/* FCCOB9 Bit Fields */
#define FTFE_FCCOB9_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB9_CCOBn_SHIFT                  0
#define FTFE_FCCOB9_CCOBn_WIDTH                  8
#define FTFE_FCCOB9_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB9_CCOBn_SHIFT))&FTFE_FCCOB9_CCOBn_MASK)
/* FCCOB8 Bit Fields */
#define FTFE_FCCOB8_CCOBn_MASK                   0xFFu
#define FTFE_FCCOB8_CCOBn_SHIFT                  0
#define FTFE_FCCOB8_CCOBn_WIDTH                  8
#define FTFE_FCCOB8_CCOBn(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FCCOB8_CCOBn_SHIFT))&FTFE_FCCOB8_CCOBn_MASK)
/* FPROT3 Bit Fields */
#define FTFE_FPROT3_PROT_MASK                    0xFFu
#define FTFE_FPROT3_PROT_SHIFT                   0
#define FTFE_FPROT3_PROT_WIDTH                   8
#define FTFE_FPROT3_PROT(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FPROT3_PROT_SHIFT))&FTFE_FPROT3_PROT_MASK)
/* FPROT2 Bit Fields */
#define FTFE_FPROT2_PROT_MASK                    0xFFu
#define FTFE_FPROT2_PROT_SHIFT                   0
#define FTFE_FPROT2_PROT_WIDTH                   8
#define FTFE_FPROT2_PROT(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FPROT2_PROT_SHIFT))&FTFE_FPROT2_PROT_MASK)
/* FPROT1 Bit Fields */
#define FTFE_FPROT1_PROT_MASK                    0xFFu
#define FTFE_FPROT1_PROT_SHIFT                   0
#define FTFE_FPROT1_PROT_WIDTH                   8
#define FTFE_FPROT1_PROT(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FPROT1_PROT_SHIFT))&FTFE_FPROT1_PROT_MASK)
/* FPROT0 Bit Fields */
#define FTFE_FPROT0_PROT_MASK                    0xFFu
#define FTFE_FPROT0_PROT_SHIFT                   0
#define FTFE_FPROT0_PROT_WIDTH                   8
#define FTFE_FPROT0_PROT(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FPROT0_PROT_SHIFT))&FTFE_FPROT0_PROT_MASK)
/* FEPROT Bit Fields */
#define FTFE_FEPROT_EPROT_MASK                   0xFFu
#define FTFE_FEPROT_EPROT_SHIFT                  0
#define FTFE_FEPROT_EPROT_WIDTH                  8
#define FTFE_FEPROT_EPROT(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FEPROT_EPROT_SHIFT))&FTFE_FEPROT_EPROT_MASK)
/* FDPROT Bit Fields */
#define FTFE_FDPROT_DPROT_MASK                   0xFFu
#define FTFE_FDPROT_DPROT_SHIFT                  0
#define FTFE_FDPROT_DPROT_WIDTH                  8
#define FTFE_FDPROT_DPROT(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FDPROT_DPROT_SHIFT))&FTFE_FDPROT_DPROT_MASK)
/* XACCH3 Bit Fields */
#define FTFE_XACCH3_XA_MASK                      0xFFu
#define FTFE_XACCH3_XA_SHIFT                     0
#define FTFE_XACCH3_XA_WIDTH                     8
#define FTFE_XACCH3_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCH3_XA_SHIFT))&FTFE_XACCH3_XA_MASK)
/* XACCH2 Bit Fields */
#define FTFE_XACCH2_XA_MASK                      0xFFu
#define FTFE_XACCH2_XA_SHIFT                     0
#define FTFE_XACCH2_XA_WIDTH                     8
#define FTFE_XACCH2_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCH2_XA_SHIFT))&FTFE_XACCH2_XA_MASK)
/* XACCH1 Bit Fields */
#define FTFE_XACCH1_XA_MASK                      0xFFu
#define FTFE_XACCH1_XA_SHIFT                     0
#define FTFE_XACCH1_XA_WIDTH                     8
#define FTFE_XACCH1_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCH1_XA_SHIFT))&FTFE_XACCH1_XA_MASK)
/* XACCH0 Bit Fields */
#define FTFE_XACCH0_XA_MASK                      0xFFu
#define FTFE_XACCH0_XA_SHIFT                     0
#define FTFE_XACCH0_XA_WIDTH                     8
#define FTFE_XACCH0_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCH0_XA_SHIFT))&FTFE_XACCH0_XA_MASK)
/* XACCL3 Bit Fields */
#define FTFE_XACCL3_XA_MASK                      0xFFu
#define FTFE_XACCL3_XA_SHIFT                     0
#define FTFE_XACCL3_XA_WIDTH                     8
#define FTFE_XACCL3_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCL3_XA_SHIFT))&FTFE_XACCL3_XA_MASK)
/* XACCL2 Bit Fields */
#define FTFE_XACCL2_XA_MASK                      0xFFu
#define FTFE_XACCL2_XA_SHIFT                     0
#define FTFE_XACCL2_XA_WIDTH                     8
#define FTFE_XACCL2_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCL2_XA_SHIFT))&FTFE_XACCL2_XA_MASK)
/* XACCL1 Bit Fields */
#define FTFE_XACCL1_XA_MASK                      0xFFu
#define FTFE_XACCL1_XA_SHIFT                     0
#define FTFE_XACCL1_XA_WIDTH                     8
#define FTFE_XACCL1_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCL1_XA_SHIFT))&FTFE_XACCL1_XA_MASK)
/* XACCL0 Bit Fields */
#define FTFE_XACCL0_XA_MASK                      0xFFu
#define FTFE_XACCL0_XA_SHIFT                     0
#define FTFE_XACCL0_XA_WIDTH                     8
#define FTFE_XACCL0_XA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_XACCL0_XA_SHIFT))&FTFE_XACCL0_XA_MASK)
/* SACCH3 Bit Fields */
#define FTFE_SACCH3_SA_MASK                      0xFFu
#define FTFE_SACCH3_SA_SHIFT                     0
#define FTFE_SACCH3_SA_WIDTH                     8
#define FTFE_SACCH3_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCH3_SA_SHIFT))&FTFE_SACCH3_SA_MASK)
/* SACCH2 Bit Fields */
#define FTFE_SACCH2_SA_MASK                      0xFFu
#define FTFE_SACCH2_SA_SHIFT                     0
#define FTFE_SACCH2_SA_WIDTH                     8
#define FTFE_SACCH2_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCH2_SA_SHIFT))&FTFE_SACCH2_SA_MASK)
/* SACCH1 Bit Fields */
#define FTFE_SACCH1_SA_MASK                      0xFFu
#define FTFE_SACCH1_SA_SHIFT                     0
#define FTFE_SACCH1_SA_WIDTH                     8
#define FTFE_SACCH1_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCH1_SA_SHIFT))&FTFE_SACCH1_SA_MASK)
/* SACCH0 Bit Fields */
#define FTFE_SACCH0_SA_MASK                      0xFFu
#define FTFE_SACCH0_SA_SHIFT                     0
#define FTFE_SACCH0_SA_WIDTH                     8
#define FTFE_SACCH0_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCH0_SA_SHIFT))&FTFE_SACCH0_SA_MASK)
/* SACCL3 Bit Fields */
#define FTFE_SACCL3_SA_MASK                      0xFFu
#define FTFE_SACCL3_SA_SHIFT                     0
#define FTFE_SACCL3_SA_WIDTH                     8
#define FTFE_SACCL3_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCL3_SA_SHIFT))&FTFE_SACCL3_SA_MASK)
/* SACCL2 Bit Fields */
#define FTFE_SACCL2_SA_MASK                      0xFFu
#define FTFE_SACCL2_SA_SHIFT                     0
#define FTFE_SACCL2_SA_WIDTH                     8
#define FTFE_SACCL2_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCL2_SA_SHIFT))&FTFE_SACCL2_SA_MASK)
/* SACCL1 Bit Fields */
#define FTFE_SACCL1_SA_MASK                      0xFFu
#define FTFE_SACCL1_SA_SHIFT                     0
#define FTFE_SACCL1_SA_WIDTH                     8
#define FTFE_SACCL1_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCL1_SA_SHIFT))&FTFE_SACCL1_SA_MASK)
/* SACCL0 Bit Fields */
#define FTFE_SACCL0_SA_MASK                      0xFFu
#define FTFE_SACCL0_SA_SHIFT                     0
#define FTFE_SACCL0_SA_WIDTH                     8
#define FTFE_SACCL0_SA(x)                        (((uint8_t)(((uint8_t)(x))<<FTFE_SACCL0_SA_SHIFT))&FTFE_SACCL0_SA_MASK)
/* FACSS Bit Fields */
#define FTFE_FACSS_SGSIZE_MASK                   0xFFu
#define FTFE_FACSS_SGSIZE_SHIFT                  0
#define FTFE_FACSS_SGSIZE_WIDTH                  8
#define FTFE_FACSS_SGSIZE(x)                     (((uint8_t)(((uint8_t)(x))<<FTFE_FACSS_SGSIZE_SHIFT))&FTFE_FACSS_SGSIZE_MASK)
/* FACSN Bit Fields */
#define FTFE_FACSN_NUMSG_MASK                    0xFFu
#define FTFE_FACSN_NUMSG_SHIFT                   0
#define FTFE_FACSN_NUMSG_WIDTH                   8
#define FTFE_FACSN_NUMSG(x)                      (((uint8_t)(((uint8_t)(x))<<FTFE_FACSN_NUMSG_SHIFT))&FTFE_FACSN_NUMSG_MASK)

/*!
 * @}
 */ /* end of group FTFE_Register_Masks */


/* FTFE - Peripheral instance base addresses */
/** Peripheral FTFE base address */
#define FTFE_BASE                                (0x40020000u)
/** Peripheral FTFE base pointer */
#define FTFE                                     ((FTFE_Type *)FTFE_BASE)
#define FTFE_BASE_PTR                            (FTFE)
/** Array initializer of FTFE peripheral base addresses */
#define FTFE_BASE_ADDRS                          { FTFE_BASE }
/** Array initializer of FTFE peripheral base pointers */
#define FTFE_BASE_PTRS                           { FTFE }
/** Interrupt vectors for the FTFE peripheral type */
#define FTFE_COMMAND_COMPLETE_IRQS               { FTFE_IRQn }
#define FTFE_READ_COLLISION_IRQS                 { Read_Collision_IRQn }

/* ----------------------------------------------------------------------------
   -- FTFE - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTFE_Register_Accessor_Macros FTFE - Register accessor macros
 * @{
 */


/* FTFE - Register instance definitions */
/* FTFE */
#define FTFE_FSTAT                               FTFE_FSTAT_REG(FTFE)
#define FTFE_FCNFG                               FTFE_FCNFG_REG(FTFE)
#define FTFE_FSEC                                FTFE_FSEC_REG(FTFE)
#define FTFE_FOPT                                FTFE_FOPT_REG(FTFE)
#define FTFE_FCCOB3                              FTFE_FCCOB3_REG(FTFE)
#define FTFE_FCCOB2                              FTFE_FCCOB2_REG(FTFE)
#define FTFE_FCCOB1                              FTFE_FCCOB1_REG(FTFE)
#define FTFE_FCCOB0                              FTFE_FCCOB0_REG(FTFE)
#define FTFE_FCCOB7                              FTFE_FCCOB7_REG(FTFE)
#define FTFE_FCCOB6                              FTFE_FCCOB6_REG(FTFE)
#define FTFE_FCCOB5                              FTFE_FCCOB5_REG(FTFE)
#define FTFE_FCCOB4                              FTFE_FCCOB4_REG(FTFE)
#define FTFE_FCCOBB                              FTFE_FCCOBB_REG(FTFE)
#define FTFE_FCCOBA                              FTFE_FCCOBA_REG(FTFE)
#define FTFE_FCCOB9                              FTFE_FCCOB9_REG(FTFE)
#define FTFE_FCCOB8                              FTFE_FCCOB8_REG(FTFE)
#define FTFE_FPROT3                              FTFE_FPROT3_REG(FTFE)
#define FTFE_FPROT2                              FTFE_FPROT2_REG(FTFE)
#define FTFE_FPROT1                              FTFE_FPROT1_REG(FTFE)
#define FTFE_FPROT0                              FTFE_FPROT0_REG(FTFE)
#define FTFE_FEPROT                              FTFE_FEPROT_REG(FTFE)
#define FTFE_FDPROT                              FTFE_FDPROT_REG(FTFE)
#define FTFE_XACCH3                              FTFE_XACCH3_REG(FTFE)
#define FTFE_XACCH2                              FTFE_XACCH2_REG(FTFE)
#define FTFE_XACCH1                              FTFE_XACCH1_REG(FTFE)
#define FTFE_XACCH0                              FTFE_XACCH0_REG(FTFE)
#define FTFE_XACCL3                              FTFE_XACCL3_REG(FTFE)
#define FTFE_XACCL2                              FTFE_XACCL2_REG(FTFE)
#define FTFE_XACCL1                              FTFE_XACCL1_REG(FTFE)
#define FTFE_XACCL0                              FTFE_XACCL0_REG(FTFE)
#define FTFE_SACCH3                              FTFE_SACCH3_REG(FTFE)
#define FTFE_SACCH2                              FTFE_SACCH2_REG(FTFE)
#define FTFE_SACCH1                              FTFE_SACCH1_REG(FTFE)
#define FTFE_SACCH0                              FTFE_SACCH0_REG(FTFE)
#define FTFE_SACCL3                              FTFE_SACCL3_REG(FTFE)
#define FTFE_SACCL2                              FTFE_SACCL2_REG(FTFE)
#define FTFE_SACCL1                              FTFE_SACCL1_REG(FTFE)
#define FTFE_SACCL0                              FTFE_SACCL0_REG(FTFE)
#define FTFE_FACSS                               FTFE_FACSS_REG(FTFE)
#define FTFE_FACSN                               FTFE_FACSN_REG(FTFE)

/*!
 * @}
 */ /* end of group FTFE_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group FTFE_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- FTM Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Peripheral_Access_Layer FTM Peripheral Access Layer
 * @{
 */

/** FTM - Register Layout Typedef */
typedef struct {
  __IO uint32_t SC;                                /**< Status And Control, offset: 0x0 */
  __IO uint32_t CNT;                               /**< Counter, offset: 0x4 */
  __IO uint32_t MOD;                               /**< Modulo, offset: 0x8 */
  struct {                                         /* offset: 0xC, array step: 0x8 */
    __IO uint32_t CnSC;                              /**< Channel (n) Status And Control, array offset: 0xC, array step: 0x8 */
    __IO uint32_t CnV;                               /**< Channel (n) Value, array offset: 0x10, array step: 0x8 */
  } CONTROLS[8];
  __IO uint32_t CNTIN;                             /**< Counter Initial Value, offset: 0x4C */
  __IO uint32_t STATUS;                            /**< Capture And Compare Status, offset: 0x50 */
  __IO uint32_t MODE;                              /**< Features Mode Selection, offset: 0x54 */
  __IO uint32_t SYNC;                              /**< Synchronization, offset: 0x58 */
  __IO uint32_t OUTINIT;                           /**< Initial State For Channels Output, offset: 0x5C */
  __IO uint32_t OUTMASK;                           /**< Output Mask, offset: 0x60 */
  __IO uint32_t COMBINE;                           /**< Function For Linked Channels, offset: 0x64 */
  __IO uint32_t DEADTIME;                          /**< Deadtime Insertion Control, offset: 0x68 */
  __IO uint32_t EXTTRIG;                           /**< FTM External Trigger, offset: 0x6C */
  __IO uint32_t POL;                               /**< Channels Polarity, offset: 0x70 */
  __IO uint32_t FMS;                               /**< Fault Mode Status, offset: 0x74 */
  __IO uint32_t FILTER;                            /**< Input Capture Filter Control, offset: 0x78 */
  __IO uint32_t FLTCTRL;                           /**< Fault Control, offset: 0x7C */
  __IO uint32_t QDCTRL;                            /**< Quadrature Decoder Control And Status, offset: 0x80 */
  __IO uint32_t CONF;                              /**< Configuration, offset: 0x84 */
  __IO uint32_t FLTPOL;                            /**< FTM Fault Input Polarity, offset: 0x88 */
  __IO uint32_t SYNCONF;                           /**< Synchronization Configuration, offset: 0x8C */
  __IO uint32_t INVCTRL;                           /**< FTM Inverting Control, offset: 0x90 */
  __IO uint32_t SWOCTRL;                           /**< FTM Software Output Control, offset: 0x94 */
  __IO uint32_t PWMLOAD;                           /**< FTM PWM Load, offset: 0x98 */
} FTM_Type, *FTM_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- FTM - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup FTM_Register_Accessor_Macros FTM - Register accessor macros
 * @{
 */


