RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18.h
/* ID Bit Fields */
#define USBHS_ID_ID_MASK                         0x3Fu
#define USBHS_ID_ID_SHIFT                        0
#define USBHS_ID_ID_WIDTH                        6
#define USBHS_ID_ID(x)                           (((uint32_t)(((uint32_t)(x))<<USBHS_ID_ID_SHIFT))&USBHS_ID_ID_MASK)
#define USBHS_ID_NID_MASK                        0x3F00u
#define USBHS_ID_NID_SHIFT                       8
#define USBHS_ID_NID_WIDTH                       6
#define USBHS_ID_NID(x)                          (((uint32_t)(((uint32_t)(x))<<USBHS_ID_NID_SHIFT))&USBHS_ID_NID_MASK)
#define USBHS_ID_TAG_MASK                        0x1F0000u
#define USBHS_ID_TAG_SHIFT                       16
#define USBHS_ID_TAG_WIDTH                       5
#define USBHS_ID_TAG(x)                          (((uint32_t)(((uint32_t)(x))<<USBHS_ID_TAG_SHIFT))&USBHS_ID_TAG_MASK)
#define USBHS_ID_REVISION_MASK                   0x1E00000u
#define USBHS_ID_REVISION_SHIFT                  21
#define USBHS_ID_REVISION_WIDTH                  4
#define USBHS_ID_REVISION(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_ID_REVISION_SHIFT))&USBHS_ID_REVISION_MASK)
#define USBHS_ID_VERSION_MASK                    0x1E000000u
#define USBHS_ID_VERSION_SHIFT                   25
#define USBHS_ID_VERSION_WIDTH                   4
#define USBHS_ID_VERSION(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_ID_VERSION_SHIFT))&USBHS_ID_VERSION_MASK)
#define USBHS_ID_VERSIONID_MASK                  0xE0000000u
#define USBHS_ID_VERSIONID_SHIFT                 29
#define USBHS_ID_VERSIONID_WIDTH                 3
#define USBHS_ID_VERSIONID(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_ID_VERSIONID_SHIFT))&USBHS_ID_VERSIONID_MASK)
/* HWGENERAL Bit Fields */
#define USBHS_HWGENERAL_PHYW_MASK                0x30u
#define USBHS_HWGENERAL_PHYW_SHIFT               4
#define USBHS_HWGENERAL_PHYW_WIDTH               2
#define USBHS_HWGENERAL_PHYW(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_HWGENERAL_PHYW_SHIFT))&USBHS_HWGENERAL_PHYW_MASK)
#define USBHS_HWGENERAL_PHYM_MASK                0x1C0u
#define USBHS_HWGENERAL_PHYM_SHIFT               6
#define USBHS_HWGENERAL_PHYM_WIDTH               3
#define USBHS_HWGENERAL_PHYM(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_HWGENERAL_PHYM_SHIFT))&USBHS_HWGENERAL_PHYM_MASK)
#define USBHS_HWGENERAL_SM_MASK                  0x600u
#define USBHS_HWGENERAL_SM_SHIFT                 9
#define USBHS_HWGENERAL_SM_WIDTH                 2
#define USBHS_HWGENERAL_SM(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_HWGENERAL_SM_SHIFT))&USBHS_HWGENERAL_SM_MASK)
/* HWHOST Bit Fields */
#define USBHS_HWHOST_HC_MASK                     0x1u
#define USBHS_HWHOST_HC_SHIFT                    0
#define USBHS_HWHOST_HC_WIDTH                    1
#define USBHS_HWHOST_HC(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_HWHOST_HC_SHIFT))&USBHS_HWHOST_HC_MASK)
#define USBHS_HWHOST_NPORT_MASK                  0xEu
#define USBHS_HWHOST_NPORT_SHIFT                 1
#define USBHS_HWHOST_NPORT_WIDTH                 3
#define USBHS_HWHOST_NPORT(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_HWHOST_NPORT_SHIFT))&USBHS_HWHOST_NPORT_MASK)
#define USBHS_HWHOST_TTASY_MASK                  0xFF0000u
#define USBHS_HWHOST_TTASY_SHIFT                 16
#define USBHS_HWHOST_TTASY_WIDTH                 8
#define USBHS_HWHOST_TTASY(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_HWHOST_TTASY_SHIFT))&USBHS_HWHOST_TTASY_MASK)
#define USBHS_HWHOST_TTPER_MASK                  0xFF000000u
#define USBHS_HWHOST_TTPER_SHIFT                 24
#define USBHS_HWHOST_TTPER_WIDTH                 8
#define USBHS_HWHOST_TTPER(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_HWHOST_TTPER_SHIFT))&USBHS_HWHOST_TTPER_MASK)
/* HWDEVICE Bit Fields */
#define USBHS_HWDEVICE_DC_MASK                   0x1u
#define USBHS_HWDEVICE_DC_SHIFT                  0
#define USBHS_HWDEVICE_DC_WIDTH                  1
#define USBHS_HWDEVICE_DC(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_HWDEVICE_DC_SHIFT))&USBHS_HWDEVICE_DC_MASK)
#define USBHS_HWDEVICE_DEVEP_MASK                0x3Eu
#define USBHS_HWDEVICE_DEVEP_SHIFT               1
#define USBHS_HWDEVICE_DEVEP_WIDTH               5
#define USBHS_HWDEVICE_DEVEP(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_HWDEVICE_DEVEP_SHIFT))&USBHS_HWDEVICE_DEVEP_MASK)
/* HWTXBUF Bit Fields */
#define USBHS_HWTXBUF_TXBURST_MASK               0xFFu
#define USBHS_HWTXBUF_TXBURST_SHIFT              0
#define USBHS_HWTXBUF_TXBURST_WIDTH              8
#define USBHS_HWTXBUF_TXBURST(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_HWTXBUF_TXBURST_SHIFT))&USBHS_HWTXBUF_TXBURST_MASK)
#define USBHS_HWTXBUF_TXADD_MASK                 0xFF00u
#define USBHS_HWTXBUF_TXADD_SHIFT                8
#define USBHS_HWTXBUF_TXADD_WIDTH                8
#define USBHS_HWTXBUF_TXADD(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_HWTXBUF_TXADD_SHIFT))&USBHS_HWTXBUF_TXADD_MASK)
#define USBHS_HWTXBUF_TXCHANADD_MASK             0xFF0000u
#define USBHS_HWTXBUF_TXCHANADD_SHIFT            16
#define USBHS_HWTXBUF_TXCHANADD_WIDTH            8
#define USBHS_HWTXBUF_TXCHANADD(x)               (((uint32_t)(((uint32_t)(x))<<USBHS_HWTXBUF_TXCHANADD_SHIFT))&USBHS_HWTXBUF_TXCHANADD_MASK)
#define USBHS_HWTXBUF_TXLC_MASK                  0x80000000u
#define USBHS_HWTXBUF_TXLC_SHIFT                 31
#define USBHS_HWTXBUF_TXLC_WIDTH                 1
#define USBHS_HWTXBUF_TXLC(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_HWTXBUF_TXLC_SHIFT))&USBHS_HWTXBUF_TXLC_MASK)
/* HWRXBUF Bit Fields */
#define USBHS_HWRXBUF_RXBURST_MASK               0xFFu
#define USBHS_HWRXBUF_RXBURST_SHIFT              0
#define USBHS_HWRXBUF_RXBURST_WIDTH              8
#define USBHS_HWRXBUF_RXBURST(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_HWRXBUF_RXBURST_SHIFT))&USBHS_HWRXBUF_RXBURST_MASK)
#define USBHS_HWRXBUF_RXADD_MASK                 0xFF00u
#define USBHS_HWRXBUF_RXADD_SHIFT                8
#define USBHS_HWRXBUF_RXADD_WIDTH                8
#define USBHS_HWRXBUF_RXADD(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_HWRXBUF_RXADD_SHIFT))&USBHS_HWRXBUF_RXADD_MASK)
/* GPTIMER0LD Bit Fields */
#define USBHS_GPTIMER0LD_GPTLD_MASK              0xFFFFFFu
#define USBHS_GPTIMER0LD_GPTLD_SHIFT             0
#define USBHS_GPTIMER0LD_GPTLD_WIDTH             24
#define USBHS_GPTIMER0LD_GPTLD(x)                (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER0LD_GPTLD_SHIFT))&USBHS_GPTIMER0LD_GPTLD_MASK)
/* GPTIMER0CTL Bit Fields */
#define USBHS_GPTIMER0CTL_GPTCNT_MASK            0xFFFFFFu
#define USBHS_GPTIMER0CTL_GPTCNT_SHIFT           0
#define USBHS_GPTIMER0CTL_GPTCNT_WIDTH           24
#define USBHS_GPTIMER0CTL_GPTCNT(x)              (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER0CTL_GPTCNT_SHIFT))&USBHS_GPTIMER0CTL_GPTCNT_MASK)
#define USBHS_GPTIMER0CTL_MODE_MASK              0x1000000u
#define USBHS_GPTIMER0CTL_MODE_SHIFT             24
#define USBHS_GPTIMER0CTL_MODE_WIDTH             1
#define USBHS_GPTIMER0CTL_MODE(x)                (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER0CTL_MODE_SHIFT))&USBHS_GPTIMER0CTL_MODE_MASK)
#define USBHS_GPTIMER0CTL_RST_MASK               0x40000000u
#define USBHS_GPTIMER0CTL_RST_SHIFT              30
#define USBHS_GPTIMER0CTL_RST_WIDTH              1
#define USBHS_GPTIMER0CTL_RST(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER0CTL_RST_SHIFT))&USBHS_GPTIMER0CTL_RST_MASK)
#define USBHS_GPTIMER0CTL_RUN_MASK               0x80000000u
#define USBHS_GPTIMER0CTL_RUN_SHIFT              31
#define USBHS_GPTIMER0CTL_RUN_WIDTH              1
#define USBHS_GPTIMER0CTL_RUN(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER0CTL_RUN_SHIFT))&USBHS_GPTIMER0CTL_RUN_MASK)
/* GPTIMER1LD Bit Fields */
#define USBHS_GPTIMER1LD_GPTLD_MASK              0xFFFFFFu
#define USBHS_GPTIMER1LD_GPTLD_SHIFT             0
#define USBHS_GPTIMER1LD_GPTLD_WIDTH             24
#define USBHS_GPTIMER1LD_GPTLD(x)                (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER1LD_GPTLD_SHIFT))&USBHS_GPTIMER1LD_GPTLD_MASK)
/* GPTIMER1CTL Bit Fields */
#define USBHS_GPTIMER1CTL_GPTCNT_MASK            0xFFFFFFu
#define USBHS_GPTIMER1CTL_GPTCNT_SHIFT           0
#define USBHS_GPTIMER1CTL_GPTCNT_WIDTH           24
#define USBHS_GPTIMER1CTL_GPTCNT(x)              (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER1CTL_GPTCNT_SHIFT))&USBHS_GPTIMER1CTL_GPTCNT_MASK)
#define USBHS_GPTIMER1CTL_MODE_MASK              0x1000000u
#define USBHS_GPTIMER1CTL_MODE_SHIFT             24
#define USBHS_GPTIMER1CTL_MODE_WIDTH             1
#define USBHS_GPTIMER1CTL_MODE(x)                (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER1CTL_MODE_SHIFT))&USBHS_GPTIMER1CTL_MODE_MASK)
#define USBHS_GPTIMER1CTL_RST_MASK               0x40000000u
#define USBHS_GPTIMER1CTL_RST_SHIFT              30
#define USBHS_GPTIMER1CTL_RST_WIDTH              1
#define USBHS_GPTIMER1CTL_RST(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER1CTL_RST_SHIFT))&USBHS_GPTIMER1CTL_RST_MASK)
#define USBHS_GPTIMER1CTL_RUN_MASK               0x80000000u
#define USBHS_GPTIMER1CTL_RUN_SHIFT              31
#define USBHS_GPTIMER1CTL_RUN_WIDTH              1
#define USBHS_GPTIMER1CTL_RUN(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_GPTIMER1CTL_RUN_SHIFT))&USBHS_GPTIMER1CTL_RUN_MASK)
/* USB_SBUSCFG Bit Fields */
#define USBHS_USB_SBUSCFG_BURSTMODE_MASK         0x7u
#define USBHS_USB_SBUSCFG_BURSTMODE_SHIFT        0
#define USBHS_USB_SBUSCFG_BURSTMODE_WIDTH        3
#define USBHS_USB_SBUSCFG_BURSTMODE(x)           (((uint32_t)(((uint32_t)(x))<<USBHS_USB_SBUSCFG_BURSTMODE_SHIFT))&USBHS_USB_SBUSCFG_BURSTMODE_MASK)
/* HCIVERSION Bit Fields */
#define USBHS_HCIVERSION_CAPLENGTH_MASK          0xFFu
#define USBHS_HCIVERSION_CAPLENGTH_SHIFT         0
#define USBHS_HCIVERSION_CAPLENGTH_WIDTH         8
#define USBHS_HCIVERSION_CAPLENGTH(x)            (((uint32_t)(((uint32_t)(x))<<USBHS_HCIVERSION_CAPLENGTH_SHIFT))&USBHS_HCIVERSION_CAPLENGTH_MASK)
#define USBHS_HCIVERSION_HCIVERSION_MASK         0xFFFF0000u
#define USBHS_HCIVERSION_HCIVERSION_SHIFT        16
#define USBHS_HCIVERSION_HCIVERSION_WIDTH        16
#define USBHS_HCIVERSION_HCIVERSION(x)           (((uint32_t)(((uint32_t)(x))<<USBHS_HCIVERSION_HCIVERSION_SHIFT))&USBHS_HCIVERSION_HCIVERSION_MASK)
/* HCSPARAMS Bit Fields */
#define USBHS_HCSPARAMS_N_PORTS_MASK             0xFu
#define USBHS_HCSPARAMS_N_PORTS_SHIFT            0
#define USBHS_HCSPARAMS_N_PORTS_WIDTH            4
#define USBHS_HCSPARAMS_N_PORTS(x)               (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_N_PORTS_SHIFT))&USBHS_HCSPARAMS_N_PORTS_MASK)
#define USBHS_HCSPARAMS_PPC_MASK                 0x10u
#define USBHS_HCSPARAMS_PPC_SHIFT                4
#define USBHS_HCSPARAMS_PPC_WIDTH                1
#define USBHS_HCSPARAMS_PPC(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_PPC_SHIFT))&USBHS_HCSPARAMS_PPC_MASK)
#define USBHS_HCSPARAMS_N_PCC_MASK               0xF00u
#define USBHS_HCSPARAMS_N_PCC_SHIFT              8
#define USBHS_HCSPARAMS_N_PCC_WIDTH              4
#define USBHS_HCSPARAMS_N_PCC(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_N_PCC_SHIFT))&USBHS_HCSPARAMS_N_PCC_MASK)
#define USBHS_HCSPARAMS_N_CC_MASK                0xF000u
#define USBHS_HCSPARAMS_N_CC_SHIFT               12
#define USBHS_HCSPARAMS_N_CC_WIDTH               4
#define USBHS_HCSPARAMS_N_CC(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_N_CC_SHIFT))&USBHS_HCSPARAMS_N_CC_MASK)
#define USBHS_HCSPARAMS_PI_MASK                  0x10000u
#define USBHS_HCSPARAMS_PI_SHIFT                 16
#define USBHS_HCSPARAMS_PI_WIDTH                 1
#define USBHS_HCSPARAMS_PI(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_PI_SHIFT))&USBHS_HCSPARAMS_PI_MASK)
#define USBHS_HCSPARAMS_N_PTT_MASK               0xF00000u
#define USBHS_HCSPARAMS_N_PTT_SHIFT              20
#define USBHS_HCSPARAMS_N_PTT_WIDTH              4
#define USBHS_HCSPARAMS_N_PTT(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_N_PTT_SHIFT))&USBHS_HCSPARAMS_N_PTT_MASK)
#define USBHS_HCSPARAMS_N_TT_MASK                0xF000000u
#define USBHS_HCSPARAMS_N_TT_SHIFT               24
#define USBHS_HCSPARAMS_N_TT_WIDTH               4
#define USBHS_HCSPARAMS_N_TT(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_HCSPARAMS_N_TT_SHIFT))&USBHS_HCSPARAMS_N_TT_MASK)
/* HCCPARAMS Bit Fields */
#define USBHS_HCCPARAMS_ADC_MASK                 0x1u
#define USBHS_HCCPARAMS_ADC_SHIFT                0
#define USBHS_HCCPARAMS_ADC_WIDTH                1
#define USBHS_HCCPARAMS_ADC(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_HCCPARAMS_ADC_SHIFT))&USBHS_HCCPARAMS_ADC_MASK)
#define USBHS_HCCPARAMS_PFL_MASK                 0x2u
#define USBHS_HCCPARAMS_PFL_SHIFT                1
#define USBHS_HCCPARAMS_PFL_WIDTH                1
#define USBHS_HCCPARAMS_PFL(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_HCCPARAMS_PFL_SHIFT))&USBHS_HCCPARAMS_PFL_MASK)
#define USBHS_HCCPARAMS_ASP_MASK                 0x4u
#define USBHS_HCCPARAMS_ASP_SHIFT                2
#define USBHS_HCCPARAMS_ASP_WIDTH                1
#define USBHS_HCCPARAMS_ASP(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_HCCPARAMS_ASP_SHIFT))&USBHS_HCCPARAMS_ASP_MASK)
#define USBHS_HCCPARAMS_IST_MASK                 0xF0u
#define USBHS_HCCPARAMS_IST_SHIFT                4
#define USBHS_HCCPARAMS_IST_WIDTH                4
#define USBHS_HCCPARAMS_IST(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_HCCPARAMS_IST_SHIFT))&USBHS_HCCPARAMS_IST_MASK)
#define USBHS_HCCPARAMS_EECP_MASK                0xFF00u
#define USBHS_HCCPARAMS_EECP_SHIFT               8
#define USBHS_HCCPARAMS_EECP_WIDTH               8
#define USBHS_HCCPARAMS_EECP(x)                  (((uint32_t)(((uint32_t)(x))<<USBHS_HCCPARAMS_EECP_SHIFT))&USBHS_HCCPARAMS_EECP_MASK)
/* DCIVERSION Bit Fields */
#define USBHS_DCIVERSION_DCIVERSION_MASK         0xFFFFu
#define USBHS_DCIVERSION_DCIVERSION_SHIFT        0
#define USBHS_DCIVERSION_DCIVERSION_WIDTH        16
#define USBHS_DCIVERSION_DCIVERSION(x)           (((uint16_t)(((uint16_t)(x))<<USBHS_DCIVERSION_DCIVERSION_SHIFT))&USBHS_DCIVERSION_DCIVERSION_MASK)
/* DCCPARAMS Bit Fields */
#define USBHS_DCCPARAMS_DEN_MASK                 0x1Fu
#define USBHS_DCCPARAMS_DEN_SHIFT                0
#define USBHS_DCCPARAMS_DEN_WIDTH                5
#define USBHS_DCCPARAMS_DEN(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_DCCPARAMS_DEN_SHIFT))&USBHS_DCCPARAMS_DEN_MASK)
#define USBHS_DCCPARAMS_DC_MASK                  0x80u
#define USBHS_DCCPARAMS_DC_SHIFT                 7
#define USBHS_DCCPARAMS_DC_WIDTH                 1
#define USBHS_DCCPARAMS_DC(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_DCCPARAMS_DC_SHIFT))&USBHS_DCCPARAMS_DC_MASK)
#define USBHS_DCCPARAMS_HC_MASK                  0x100u
#define USBHS_DCCPARAMS_HC_SHIFT                 8
#define USBHS_DCCPARAMS_HC_WIDTH                 1
#define USBHS_DCCPARAMS_HC(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_DCCPARAMS_HC_SHIFT))&USBHS_DCCPARAMS_HC_MASK)
/* USBCMD Bit Fields */
#define USBHS_USBCMD_RS_MASK                     0x1u
#define USBHS_USBCMD_RS_SHIFT                    0
#define USBHS_USBCMD_RS_WIDTH                    1
#define USBHS_USBCMD_RS(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_RS_SHIFT))&USBHS_USBCMD_RS_MASK)
#define USBHS_USBCMD_RST_MASK                    0x2u
#define USBHS_USBCMD_RST_SHIFT                   1
#define USBHS_USBCMD_RST_WIDTH                   1
#define USBHS_USBCMD_RST(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_RST_SHIFT))&USBHS_USBCMD_RST_MASK)
#define USBHS_USBCMD_FS_MASK                     0xCu
#define USBHS_USBCMD_FS_SHIFT                    2
#define USBHS_USBCMD_FS_WIDTH                    2
#define USBHS_USBCMD_FS(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_FS_SHIFT))&USBHS_USBCMD_FS_MASK)
#define USBHS_USBCMD_PSE_MASK                    0x10u
#define USBHS_USBCMD_PSE_SHIFT                   4
#define USBHS_USBCMD_PSE_WIDTH                   1
#define USBHS_USBCMD_PSE(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_PSE_SHIFT))&USBHS_USBCMD_PSE_MASK)
#define USBHS_USBCMD_ASE_MASK                    0x20u
#define USBHS_USBCMD_ASE_SHIFT                   5
#define USBHS_USBCMD_ASE_WIDTH                   1
#define USBHS_USBCMD_ASE(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_ASE_SHIFT))&USBHS_USBCMD_ASE_MASK)
#define USBHS_USBCMD_IAA_MASK                    0x40u
#define USBHS_USBCMD_IAA_SHIFT                   6
#define USBHS_USBCMD_IAA_WIDTH                   1
#define USBHS_USBCMD_IAA(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_IAA_SHIFT))&USBHS_USBCMD_IAA_MASK)
#define USBHS_USBCMD_ASP_MASK                    0x300u
#define USBHS_USBCMD_ASP_SHIFT                   8
#define USBHS_USBCMD_ASP_WIDTH                   2
#define USBHS_USBCMD_ASP(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_ASP_SHIFT))&USBHS_USBCMD_ASP_MASK)
#define USBHS_USBCMD_ASPE_MASK                   0x800u
#define USBHS_USBCMD_ASPE_SHIFT                  11
#define USBHS_USBCMD_ASPE_WIDTH                  1
#define USBHS_USBCMD_ASPE(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_ASPE_SHIFT))&USBHS_USBCMD_ASPE_MASK)
#define USBHS_USBCMD_SUTW_MASK                   0x2000u
#define USBHS_USBCMD_SUTW_SHIFT                  13
#define USBHS_USBCMD_SUTW_WIDTH                  1
#define USBHS_USBCMD_SUTW(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_SUTW_SHIFT))&USBHS_USBCMD_SUTW_MASK)
#define USBHS_USBCMD_ATDTW_MASK                  0x4000u
#define USBHS_USBCMD_ATDTW_SHIFT                 14
#define USBHS_USBCMD_ATDTW_WIDTH                 1
#define USBHS_USBCMD_ATDTW(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_ATDTW_SHIFT))&USBHS_USBCMD_ATDTW_MASK)
#define USBHS_USBCMD_FS2_MASK                    0x8000u
#define USBHS_USBCMD_FS2_SHIFT                   15
#define USBHS_USBCMD_FS2_WIDTH                   1
#define USBHS_USBCMD_FS2(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_FS2_SHIFT))&USBHS_USBCMD_FS2_MASK)
#define USBHS_USBCMD_ITC_MASK                    0xFF0000u
#define USBHS_USBCMD_ITC_SHIFT                   16
#define USBHS_USBCMD_ITC_WIDTH                   8
#define USBHS_USBCMD_ITC(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBCMD_ITC_SHIFT))&USBHS_USBCMD_ITC_MASK)
/* USBSTS Bit Fields */
#define USBHS_USBSTS_UI_MASK                     0x1u
#define USBHS_USBSTS_UI_SHIFT                    0
#define USBHS_USBSTS_UI_WIDTH                    1
#define USBHS_USBSTS_UI(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_UI_SHIFT))&USBHS_USBSTS_UI_MASK)
#define USBHS_USBSTS_UEI_MASK                    0x2u
#define USBHS_USBSTS_UEI_SHIFT                   1
#define USBHS_USBSTS_UEI_WIDTH                   1
#define USBHS_USBSTS_UEI(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_UEI_SHIFT))&USBHS_USBSTS_UEI_MASK)
#define USBHS_USBSTS_PCI_MASK                    0x4u
#define USBHS_USBSTS_PCI_SHIFT                   2
#define USBHS_USBSTS_PCI_WIDTH                   1
#define USBHS_USBSTS_PCI(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_PCI_SHIFT))&USBHS_USBSTS_PCI_MASK)
#define USBHS_USBSTS_FRI_MASK                    0x8u
#define USBHS_USBSTS_FRI_SHIFT                   3
#define USBHS_USBSTS_FRI_WIDTH                   1
#define USBHS_USBSTS_FRI(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_FRI_SHIFT))&USBHS_USBSTS_FRI_MASK)
#define USBHS_USBSTS_SEI_MASK                    0x10u
#define USBHS_USBSTS_SEI_SHIFT                   4
#define USBHS_USBSTS_SEI_WIDTH                   1
#define USBHS_USBSTS_SEI(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_SEI_SHIFT))&USBHS_USBSTS_SEI_MASK)
#define USBHS_USBSTS_AAI_MASK                    0x20u
#define USBHS_USBSTS_AAI_SHIFT                   5
#define USBHS_USBSTS_AAI_WIDTH                   1
#define USBHS_USBSTS_AAI(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_AAI_SHIFT))&USBHS_USBSTS_AAI_MASK)
#define USBHS_USBSTS_URI_MASK                    0x40u
#define USBHS_USBSTS_URI_SHIFT                   6
#define USBHS_USBSTS_URI_WIDTH                   1
#define USBHS_USBSTS_URI(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_URI_SHIFT))&USBHS_USBSTS_URI_MASK)
#define USBHS_USBSTS_SRI_MASK                    0x80u
#define USBHS_USBSTS_SRI_SHIFT                   7
#define USBHS_USBSTS_SRI_WIDTH                   1
#define USBHS_USBSTS_SRI(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_SRI_SHIFT))&USBHS_USBSTS_SRI_MASK)
#define USBHS_USBSTS_SLI_MASK                    0x100u
#define USBHS_USBSTS_SLI_SHIFT                   8
#define USBHS_USBSTS_SLI_WIDTH                   1
#define USBHS_USBSTS_SLI(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_SLI_SHIFT))&USBHS_USBSTS_SLI_MASK)
#define USBHS_USBSTS_HCH_MASK                    0x1000u
#define USBHS_USBSTS_HCH_SHIFT                   12
#define USBHS_USBSTS_HCH_WIDTH                   1
#define USBHS_USBSTS_HCH(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_HCH_SHIFT))&USBHS_USBSTS_HCH_MASK)
#define USBHS_USBSTS_RCL_MASK                    0x2000u
#define USBHS_USBSTS_RCL_SHIFT                   13
#define USBHS_USBSTS_RCL_WIDTH                   1
#define USBHS_USBSTS_RCL(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_RCL_SHIFT))&USBHS_USBSTS_RCL_MASK)
#define USBHS_USBSTS_PS_MASK                     0x4000u
#define USBHS_USBSTS_PS_SHIFT                    14
#define USBHS_USBSTS_PS_WIDTH                    1
#define USBHS_USBSTS_PS(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_PS_SHIFT))&USBHS_USBSTS_PS_MASK)
#define USBHS_USBSTS_AS_MASK                     0x8000u
#define USBHS_USBSTS_AS_SHIFT                    15
#define USBHS_USBSTS_AS_WIDTH                    1
#define USBHS_USBSTS_AS(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_AS_SHIFT))&USBHS_USBSTS_AS_MASK)
#define USBHS_USBSTS_NAKI_MASK                   0x10000u
#define USBHS_USBSTS_NAKI_SHIFT                  16
#define USBHS_USBSTS_NAKI_WIDTH                  1
#define USBHS_USBSTS_NAKI(x)                     (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_NAKI_SHIFT))&USBHS_USBSTS_NAKI_MASK)
#define USBHS_USBSTS_UAI_MASK                    0x40000u
#define USBHS_USBSTS_UAI_SHIFT                   18
#define USBHS_USBSTS_UAI_WIDTH                   1
#define USBHS_USBSTS_UAI(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_UAI_SHIFT))&USBHS_USBSTS_UAI_MASK)
#define USBHS_USBSTS_UPI_MASK                    0x80000u
#define USBHS_USBSTS_UPI_SHIFT                   19
#define USBHS_USBSTS_UPI_WIDTH                   1
#define USBHS_USBSTS_UPI(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_UPI_SHIFT))&USBHS_USBSTS_UPI_MASK)
#define USBHS_USBSTS_TI0_MASK                    0x1000000u
#define USBHS_USBSTS_TI0_SHIFT                   24
#define USBHS_USBSTS_TI0_WIDTH                   1
#define USBHS_USBSTS_TI0(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_TI0_SHIFT))&USBHS_USBSTS_TI0_MASK)
#define USBHS_USBSTS_TI1_MASK                    0x2000000u
#define USBHS_USBSTS_TI1_SHIFT                   25
#define USBHS_USBSTS_TI1_WIDTH                   1
#define USBHS_USBSTS_TI1(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBSTS_TI1_SHIFT))&USBHS_USBSTS_TI1_MASK)
/* USBINTR Bit Fields */
#define USBHS_USBINTR_UE_MASK                    0x1u
#define USBHS_USBINTR_UE_SHIFT                   0
#define USBHS_USBINTR_UE_WIDTH                   1
