RT-Thread/rt-thread/bsp/freescale/platform/devices/MK65F18/include/MK65F18.h
#define USBHS_OTGSC_MSE(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_MSE_SHIFT))&USBHS_OTGSC_MSE_MASK)
#define USBHS_OTGSC_DPIE_MASK                    0x40000000u
#define USBHS_OTGSC_DPIE_SHIFT                   30
#define USBHS_OTGSC_DPIE_WIDTH                   1
#define USBHS_OTGSC_DPIE(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_OTGSC_DPIE_SHIFT))&USBHS_OTGSC_DPIE_MASK)
/* USBMODE Bit Fields */
#define USBHS_USBMODE_CM_MASK                    0x3u
#define USBHS_USBMODE_CM_SHIFT                   0
#define USBHS_USBMODE_CM_WIDTH                   2
#define USBHS_USBMODE_CM(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBMODE_CM_SHIFT))&USBHS_USBMODE_CM_MASK)
#define USBHS_USBMODE_ES_MASK                    0x4u
#define USBHS_USBMODE_ES_SHIFT                   2
#define USBHS_USBMODE_ES_WIDTH                   1
#define USBHS_USBMODE_ES(x)                      (((uint32_t)(((uint32_t)(x))<<USBHS_USBMODE_ES_SHIFT))&USBHS_USBMODE_ES_MASK)
#define USBHS_USBMODE_SLOM_MASK                  0x8u
#define USBHS_USBMODE_SLOM_SHIFT                 3
#define USBHS_USBMODE_SLOM_WIDTH                 1
#define USBHS_USBMODE_SLOM(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_USBMODE_SLOM_SHIFT))&USBHS_USBMODE_SLOM_MASK)
#define USBHS_USBMODE_SDIS_MASK                  0x10u
#define USBHS_USBMODE_SDIS_SHIFT                 4
#define USBHS_USBMODE_SDIS_WIDTH                 1
#define USBHS_USBMODE_SDIS(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_USBMODE_SDIS_SHIFT))&USBHS_USBMODE_SDIS_MASK)
#define USBHS_USBMODE_TXHSD_MASK                 0x7000u
#define USBHS_USBMODE_TXHSD_SHIFT                12
#define USBHS_USBMODE_TXHSD_WIDTH                3
#define USBHS_USBMODE_TXHSD(x)                   (((uint32_t)(((uint32_t)(x))<<USBHS_USBMODE_TXHSD_SHIFT))&USBHS_USBMODE_TXHSD_MASK)
/* EPSETUPSR Bit Fields */
#define USBHS_EPSETUPSR_EPSETUPSTAT_MASK         0xFu
#define USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT        0
#define USBHS_EPSETUPSR_EPSETUPSTAT_WIDTH        4
#define USBHS_EPSETUPSR_EPSETUPSTAT(x)           (((uint32_t)(((uint32_t)(x))<<USBHS_EPSETUPSR_EPSETUPSTAT_SHIFT))&USBHS_EPSETUPSR_EPSETUPSTAT_MASK)
/* EPPRIME Bit Fields */
#define USBHS_EPPRIME_PERB_MASK                  0xFu
#define USBHS_EPPRIME_PERB_SHIFT                 0
#define USBHS_EPPRIME_PERB_WIDTH                 4
#define USBHS_EPPRIME_PERB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPPRIME_PERB_SHIFT))&USBHS_EPPRIME_PERB_MASK)
#define USBHS_EPPRIME_PETB_MASK                  0xF0000u
#define USBHS_EPPRIME_PETB_SHIFT                 16
#define USBHS_EPPRIME_PETB_WIDTH                 4
#define USBHS_EPPRIME_PETB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPPRIME_PETB_SHIFT))&USBHS_EPPRIME_PETB_MASK)
/* EPFLUSH Bit Fields */
#define USBHS_EPFLUSH_FERB_MASK                  0xFu
#define USBHS_EPFLUSH_FERB_SHIFT                 0
#define USBHS_EPFLUSH_FERB_WIDTH                 4
#define USBHS_EPFLUSH_FERB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPFLUSH_FERB_SHIFT))&USBHS_EPFLUSH_FERB_MASK)
#define USBHS_EPFLUSH_FETB_MASK                  0xF0000u
#define USBHS_EPFLUSH_FETB_SHIFT                 16
#define USBHS_EPFLUSH_FETB_WIDTH                 4
#define USBHS_EPFLUSH_FETB(x)                    (((uint32_t)(((uint32_t)(x))<<USBHS_EPFLUSH_FETB_SHIFT))&USBHS_EPFLUSH_FETB_MASK)
/* EPSR Bit Fields */
#define USBHS_EPSR_ERBR_MASK                     0xFu
#define USBHS_EPSR_ERBR_SHIFT                    0
#define USBHS_EPSR_ERBR_WIDTH                    4
#define USBHS_EPSR_ERBR(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPSR_ERBR_SHIFT))&USBHS_EPSR_ERBR_MASK)
#define USBHS_EPSR_ETBR_MASK                     0xF0000u
#define USBHS_EPSR_ETBR_SHIFT                    16
#define USBHS_EPSR_ETBR_WIDTH                    4
#define USBHS_EPSR_ETBR(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPSR_ETBR_SHIFT))&USBHS_EPSR_ETBR_MASK)
/* EPCOMPLETE Bit Fields */
#define USBHS_EPCOMPLETE_ERCE_MASK               0xFu
#define USBHS_EPCOMPLETE_ERCE_SHIFT              0
#define USBHS_EPCOMPLETE_ERCE_WIDTH              4
#define USBHS_EPCOMPLETE_ERCE(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_EPCOMPLETE_ERCE_SHIFT))&USBHS_EPCOMPLETE_ERCE_MASK)
#define USBHS_EPCOMPLETE_ETCE_MASK               0xF0000u
#define USBHS_EPCOMPLETE_ETCE_SHIFT              16
#define USBHS_EPCOMPLETE_ETCE_WIDTH              4
#define USBHS_EPCOMPLETE_ETCE(x)                 (((uint32_t)(((uint32_t)(x))<<USBHS_EPCOMPLETE_ETCE_SHIFT))&USBHS_EPCOMPLETE_ETCE_MASK)
/* EPCR0 Bit Fields */
#define USBHS_EPCR0_RXS_MASK                     0x1u
#define USBHS_EPCR0_RXS_SHIFT                    0
#define USBHS_EPCR0_RXS_WIDTH                    1
#define USBHS_EPCR0_RXS(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR0_RXS_SHIFT))&USBHS_EPCR0_RXS_MASK)
#define USBHS_EPCR0_RXT_MASK                     0xCu
#define USBHS_EPCR0_RXT_SHIFT                    2
#define USBHS_EPCR0_RXT_WIDTH                    2
#define USBHS_EPCR0_RXT(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR0_RXT_SHIFT))&USBHS_EPCR0_RXT_MASK)
#define USBHS_EPCR0_RXE_MASK                     0x80u
#define USBHS_EPCR0_RXE_SHIFT                    7
#define USBHS_EPCR0_RXE_WIDTH                    1
#define USBHS_EPCR0_RXE(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR0_RXE_SHIFT))&USBHS_EPCR0_RXE_MASK)
#define USBHS_EPCR0_TXS_MASK                     0x10000u
#define USBHS_EPCR0_TXS_SHIFT                    16
#define USBHS_EPCR0_TXS_WIDTH                    1
#define USBHS_EPCR0_TXS(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR0_TXS_SHIFT))&USBHS_EPCR0_TXS_MASK)
#define USBHS_EPCR0_TXT_MASK                     0xC0000u
#define USBHS_EPCR0_TXT_SHIFT                    18
#define USBHS_EPCR0_TXT_WIDTH                    2
#define USBHS_EPCR0_TXT(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR0_TXT_SHIFT))&USBHS_EPCR0_TXT_MASK)
#define USBHS_EPCR0_TXE_MASK                     0x800000u
#define USBHS_EPCR0_TXE_SHIFT                    23
#define USBHS_EPCR0_TXE_WIDTH                    1
#define USBHS_EPCR0_TXE(x)                       (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR0_TXE_SHIFT))&USBHS_EPCR0_TXE_MASK)
/* EPCR Bit Fields */
#define USBHS_EPCR_RXS_MASK                      0x1u
#define USBHS_EPCR_RXS_SHIFT                     0
#define USBHS_EPCR_RXS_WIDTH                     1
#define USBHS_EPCR_RXS(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_RXS_SHIFT))&USBHS_EPCR_RXS_MASK)
#define USBHS_EPCR_RXD_MASK                      0x2u
#define USBHS_EPCR_RXD_SHIFT                     1
#define USBHS_EPCR_RXD_WIDTH                     1
#define USBHS_EPCR_RXD(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_RXD_SHIFT))&USBHS_EPCR_RXD_MASK)
#define USBHS_EPCR_RXT_MASK                      0xCu
#define USBHS_EPCR_RXT_SHIFT                     2
#define USBHS_EPCR_RXT_WIDTH                     2
#define USBHS_EPCR_RXT(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_RXT_SHIFT))&USBHS_EPCR_RXT_MASK)
#define USBHS_EPCR_RXI_MASK                      0x20u
#define USBHS_EPCR_RXI_SHIFT                     5
#define USBHS_EPCR_RXI_WIDTH                     1
#define USBHS_EPCR_RXI(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_RXI_SHIFT))&USBHS_EPCR_RXI_MASK)
#define USBHS_EPCR_RXR_MASK                      0x40u
#define USBHS_EPCR_RXR_SHIFT                     6
#define USBHS_EPCR_RXR_WIDTH                     1
#define USBHS_EPCR_RXR(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_RXR_SHIFT))&USBHS_EPCR_RXR_MASK)
#define USBHS_EPCR_RXE_MASK                      0x80u
#define USBHS_EPCR_RXE_SHIFT                     7
#define USBHS_EPCR_RXE_WIDTH                     1
#define USBHS_EPCR_RXE(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_RXE_SHIFT))&USBHS_EPCR_RXE_MASK)
#define USBHS_EPCR_TXS_MASK                      0x10000u
#define USBHS_EPCR_TXS_SHIFT                     16
#define USBHS_EPCR_TXS_WIDTH                     1
#define USBHS_EPCR_TXS(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_TXS_SHIFT))&USBHS_EPCR_TXS_MASK)
#define USBHS_EPCR_TXD_MASK                      0x20000u
#define USBHS_EPCR_TXD_SHIFT                     17
#define USBHS_EPCR_TXD_WIDTH                     1
#define USBHS_EPCR_TXD(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_TXD_SHIFT))&USBHS_EPCR_TXD_MASK)
#define USBHS_EPCR_TXT_MASK                      0xC0000u
#define USBHS_EPCR_TXT_SHIFT                     18
#define USBHS_EPCR_TXT_WIDTH                     2
#define USBHS_EPCR_TXT(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_TXT_SHIFT))&USBHS_EPCR_TXT_MASK)
#define USBHS_EPCR_TXI_MASK                      0x200000u
#define USBHS_EPCR_TXI_SHIFT                     21
#define USBHS_EPCR_TXI_WIDTH                     1
#define USBHS_EPCR_TXI(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_TXI_SHIFT))&USBHS_EPCR_TXI_MASK)
#define USBHS_EPCR_TXR_MASK                      0x400000u
#define USBHS_EPCR_TXR_SHIFT                     22
#define USBHS_EPCR_TXR_WIDTH                     1
#define USBHS_EPCR_TXR(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_TXR_SHIFT))&USBHS_EPCR_TXR_MASK)
#define USBHS_EPCR_TXE_MASK                      0x800000u
#define USBHS_EPCR_TXE_SHIFT                     23
#define USBHS_EPCR_TXE_WIDTH                     1
#define USBHS_EPCR_TXE(x)                        (((uint32_t)(((uint32_t)(x))<<USBHS_EPCR_TXE_SHIFT))&USBHS_EPCR_TXE_MASK)
/* USBGENCTRL Bit Fields */
#define USBHS_USBGENCTRL_WU_IE_MASK              0x1u
#define USBHS_USBGENCTRL_WU_IE_SHIFT             0
#define USBHS_USBGENCTRL_WU_IE_WIDTH             1
#define USBHS_USBGENCTRL_WU_IE(x)                (((uint32_t)(((uint32_t)(x))<<USBHS_USBGENCTRL_WU_IE_SHIFT))&USBHS_USBGENCTRL_WU_IE_MASK)
#define USBHS_USBGENCTRL_WU_INT_CLR_MASK         0x20u
#define USBHS_USBGENCTRL_WU_INT_CLR_SHIFT        5
#define USBHS_USBGENCTRL_WU_INT_CLR_WIDTH        1
#define USBHS_USBGENCTRL_WU_INT_CLR(x)           (((uint32_t)(((uint32_t)(x))<<USBHS_USBGENCTRL_WU_INT_CLR_SHIFT))&USBHS_USBGENCTRL_WU_INT_CLR_MASK)

/*!
 * @}
 */ /* end of group USBHS_Register_Masks */


/* USBHS - Peripheral instance base addresses */
/** Peripheral USBHS base address */
#define USBHS_BASE                               (0x400A1000u)
/** Peripheral USBHS base pointer */
#define USBHS                                    ((USBHS_Type *)USBHS_BASE)
#define USBHS_BASE_PTR                           (USBHS)
/** Array initializer of USBHS peripheral base addresses */
#define USBHS_BASE_ADDRS                         { USBHS_BASE }
/** Array initializer of USBHS peripheral base pointers */
#define USBHS_BASE_PTRS                          { USBHS }
/** Interrupt vectors for the USBHS peripheral type */
#define USBHS_IRQS                               { USBHS_IRQn }

/* ----------------------------------------------------------------------------
   -- USBHS - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBHS_Register_Accessor_Macros USBHS - Register accessor macros
 * @{
 */


/* USBHS - Register instance definitions */
/* USBHS */
#define USBHS_ID                                 USBHS_ID_REG(USBHS)
#define USBHS_HWGENERAL                          USBHS_HWGENERAL_REG(USBHS)
#define USBHS_HWHOST                             USBHS_HWHOST_REG(USBHS)
#define USBHS_HWDEVICE                           USBHS_HWDEVICE_REG(USBHS)
#define USBHS_HWTXBUF                            USBHS_HWTXBUF_REG(USBHS)
#define USBHS_HWRXBUF                            USBHS_HWRXBUF_REG(USBHS)
#define USBHS_GPTIMER0LD                         USBHS_GPTIMER0LD_REG(USBHS)
#define USBHS_GPTIMER0CTL                        USBHS_GPTIMER0CTL_REG(USBHS)
#define USBHS_GPTIMER1LD                         USBHS_GPTIMER1LD_REG(USBHS)
#define USBHS_GPTIMER1CTL                        USBHS_GPTIMER1CTL_REG(USBHS)
#define USBHS_USB_SBUSCFG                        USBHS_USB_SBUSCFG_REG(USBHS)
#define USBHS_HCIVERSION                         USBHS_HCIVERSION_REG(USBHS)
#define USBHS_HCSPARAMS                          USBHS_HCSPARAMS_REG(USBHS)
#define USBHS_HCCPARAMS                          USBHS_HCCPARAMS_REG(USBHS)
#define USBHS_DCIVERSION                         USBHS_DCIVERSION_REG(USBHS)
#define USBHS_DCCPARAMS                          USBHS_DCCPARAMS_REG(USBHS)
#define USBHS_USBCMD                             USBHS_USBCMD_REG(USBHS)
#define USBHS_USBSTS                             USBHS_USBSTS_REG(USBHS)
#define USBHS_USBINTR                            USBHS_USBINTR_REG(USBHS)
#define USBHS_FRINDEX                            USBHS_FRINDEX_REG(USBHS)
#define USBHS_DEVICEADDR                         USBHS_DEVICEADDR_REG(USBHS)
#define USBHS_PERIODICLISTBASE                   USBHS_PERIODICLISTBASE_REG(USBHS)
#define USBHS_ASYNCLISTADDR                      USBHS_ASYNCLISTADDR_REG(USBHS)
#define USBHS_EPLISTADDR                         USBHS_EPLISTADDR_REG(USBHS)
#define USBHS_TTCTRL                             USBHS_TTCTRL_REG(USBHS)
#define USBHS_BURSTSIZE                          USBHS_BURSTSIZE_REG(USBHS)
#define USBHS_TXFILLTUNING                       USBHS_TXFILLTUNING_REG(USBHS)
#define USBHS_ENDPTNAK                           USBHS_ENDPTNAK_REG(USBHS)
#define USBHS_ENDPTNAKEN                         USBHS_ENDPTNAKEN_REG(USBHS)
#define USBHS_CONFIGFLAG                         USBHS_CONFIGFLAG_REG(USBHS)
#define USBHS_PORTSC1                            USBHS_PORTSC1_REG(USBHS)
#define USBHS_OTGSC                              USBHS_OTGSC_REG(USBHS)
#define USBHS_USBMODE                            USBHS_USBMODE_REG(USBHS)
#define USBHS_EPSETUPSR                          USBHS_EPSETUPSR_REG(USBHS)
#define USBHS_EPPRIME                            USBHS_EPPRIME_REG(USBHS)
#define USBHS_EPFLUSH                            USBHS_EPFLUSH_REG(USBHS)
#define USBHS_EPSR                               USBHS_EPSR_REG(USBHS)
#define USBHS_EPCOMPLETE                         USBHS_EPCOMPLETE_REG(USBHS)
#define USBHS_EPCR0                              USBHS_EPCR0_REG(USBHS)
#define USBHS_EPCR1                              USBHS_EPCR_REG(USBHS,0)
#define USBHS_EPCR2                              USBHS_EPCR_REG(USBHS,1)
#define USBHS_EPCR3                              USBHS_EPCR_REG(USBHS,2)
#define USBHS_EPCR4                              USBHS_EPCR_REG(USBHS,3)
#define USBHS_EPCR5                              USBHS_EPCR_REG(USBHS,4)
#define USBHS_EPCR6                              USBHS_EPCR_REG(USBHS,5)
#define USBHS_EPCR7                              USBHS_EPCR_REG(USBHS,6)
#define USBHS_USBGENCTRL                         USBHS_USBGENCTRL_REG(USBHS)

/* USBHS - Register array accessors */
#define USBHS_EPCR(index)                        USBHS_EPCR_REG(USBHS,index)

/*!
 * @}
 */ /* end of group USBHS_Register_Accessor_Macros */


/*!
 * @}
 */ /* end of group USBHS_Peripheral_Access_Layer */


/* ----------------------------------------------------------------------------
   -- USBHSDCD Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBHSDCD_Peripheral_Access_Layer USBHSDCD Peripheral Access Layer
 * @{
 */

/** USBHSDCD - Register Layout Typedef */
typedef struct {
  __IO uint32_t CONTROL;                           /**< Control register, offset: 0x0 */
  __IO uint32_t CLOCK;                             /**< Clock register, offset: 0x4 */
  __I  uint32_t STATUS;                            /**< Status register, offset: 0x8 */
  __IO uint32_t SIGNAL_OVERRIDE;                   /**< Signal Override Register, offset: 0xC */
  __IO uint32_t TIMER0;                            /**< TIMER0 register, offset: 0x10 */
  __IO uint32_t TIMER1;                            /**< TIMER1 register, offset: 0x14 */
  union {                                          /* offset: 0x18 */
    __IO uint32_t TIMER2_BC11;                       /**< TIMER2_BC11 register, offset: 0x18 */
    __IO uint32_t TIMER2_BC12;                       /**< TIMER2_BC12 register, offset: 0x18 */
  };
} USBHSDCD_Type, *USBHSDCD_MemMapPtr;

/* ----------------------------------------------------------------------------
   -- USBHSDCD - Register accessor macros
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBHSDCD_Register_Accessor_Macros USBHSDCD - Register accessor macros
 * @{
 */


/* USBHSDCD - Register accessors */
#define USBHSDCD_CONTROL_REG(base)               ((base)->CONTROL)
#define USBHSDCD_CLOCK_REG(base)                 ((base)->CLOCK)
#define USBHSDCD_STATUS_REG(base)                ((base)->STATUS)
#define USBHSDCD_SIGNAL_OVERRIDE_REG(base)       ((base)->SIGNAL_OVERRIDE)
#define USBHSDCD_TIMER0_REG(base)                ((base)->TIMER0)
#define USBHSDCD_TIMER1_REG(base)                ((base)->TIMER1)
#define USBHSDCD_TIMER2_BC11_REG(base)           ((base)->TIMER2_BC11)
#define USBHSDCD_TIMER2_BC12_REG(base)           ((base)->TIMER2_BC12)

/*!
 * @}
 */ /* end of group USBHSDCD_Register_Accessor_Macros */


/* ----------------------------------------------------------------------------
   -- USBHSDCD Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup USBHSDCD_Register_Masks USBHSDCD Register Masks
 * @{
 */

